In [1]:
import pandas as pd
import numpy as np

In [2]:
from pandas import DataFrame,Series
from numpy.random import randn

In [3]:
dframe=DataFrame({'k1':['a','b','c','d','e'],'k2':['10','20','30','40','50'],'dataset1':np.random.randn(5),'dataset2':np.random.randn(5)})

In [4]:
dframe

   dataset1  dataset2 k1  k2
0 -0.702834  1.537249  a  10
1  1.337138  0.399876  b  20
2  1.707975  0.386301  c  30
3 -0.076491  1.022981  d  40
4  0.491361 -0.831473  e  50

In [5]:
group=dframe['dataset1'].groupby(dframe['k1'])

In [6]:
group

In [7]:
group.mean()

k1
a   -0.702834
b    1.337138
c    1.707975
d   -0.076491
e    0.491361
Name: dataset1, dtype: float64

In [15]:
cities=np.array(['NY','NJ','NY','CA','NJ'])

In [16]:
cities

array(['NY', 'NJ', 'NY', 'CA', 'NJ'],
      dtype='<U2')

In [17]:
month=np.array(['JAN','FEB','FEB','APR','JAN'])

In [18]:
month

array(['JAN', 'FEB', 'FEB', 'APR', 'JAN'],
      dtype='<U3')

In [19]:
dframe['dataset1'].groupby([cities,month]).mean()

CA  APR   -0.076491
NJ  FEB    1.337138
    JAN    0.491361
NY  FEB    1.707975
    JAN   -0.702834
Name: dataset1, dtype: float64

In [21]:
dframe.groupby('k1').mean()

    dataset1  dataset2
k1
a  -0.702834  1.537249
b   1.337138  0.399876
c   1.707975  0.386301
d  -0.076491  1.022981
e   0.491361 -0.831473

In [23]:
dframe.groupby(['k1','k2']).mean()

       dataset1  dataset2
k1 k2
a  10 -0.702834  1.537249
b  20  1.337138  0.399876
c  30  1.707975  0.386301
d  40 -0.076491  1.022981
e  50  0.491361 -0.831473

In [25]:
dframe.groupby(['k1']).size()

k1
a    1
b    1
c    1
d    1
e    1
dtype: int64

In [32]:
for name,group in dframe.groupby(['k1']):
    print ('this is %s group'%name)
    print (group)

this is a group
   dataset1  dataset2 k1  k2
0 -0.702834  1.537249  a  10
this is b group
   dataset1  dataset2 k1  k2
1  1.337138  0.399876  b  20
this is c group
   dataset1  dataset2 k1  k2
2  1.707975  0.386301  c  30
this is d group
   dataset1  dataset2 k1  k2
3 -0.076491  1.022981  d  40
this is e group
   dataset1  dataset2 k1  k2
4  0.491361 -0.831473  e  50

In [35]:
animals=DataFrame(np.arange(16).reshape(4,4),index=['Dog', 'Cat', 'Bird', 'Mouse'],columns=['W', 'X', 'Y', 'Z'])

In [36]:
animals

        W   X   Y   Z
Dog     0   1   2   3
Cat     4   5   6   7
Bird    8   9  10  11
Mouse  12  13  14  15

In [37]:
animals.ix[1:2,['W','Y']]=np.nan

C:\Users\bilal\Anaconda3\lib\site-packages\ipykernel\__main__.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  if __name__ == '__main__':

In [38]:
animals

          W   X     Y   Z
Dog     0.0   1   2.0   3
Cat     NaN   5   NaN   7
Bird    8.0   9  10.0  11
Mouse  12.0  13  14.0  15

In [40]:
behaviormap={'W':'good','X':'bad','Y':'good','Z':'bad'}

In [41]:
behaviormap

{'W': 'good', 'X': 'bad', 'Y': 'good', 'Z': 'bad'}

In [44]:
aa=animals.groupby(behaviormap,axis=1)

In [45]:
aa

In [46]:
aa.sum()

        bad  good
Dog     4.0   2.0
Cat    12.0   NaN
Bird   20.0  18.0
Mouse  28.0  26.0

In [55]:
s=DataFrame(np.arange(16).reshape(4,4),index=['a','b','c','d'],columns=[1,2,3,4])

In [56]:
s

    1   2   3   4
a   0   1   2   3
b   4   5   6   7
c   8   9  10  11
d  12  13  14  15